## Dataset: Renewable Energy (1960-2023)
[Fuente](https://www.kaggle.com/datasets/imtkaggleteam/renewable-energy-1960-2023/data)

In [1]:
# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

# Visualización
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns

# Evaluar linealidad de las relaciones entre las variables
# y la distribución de las variables
# ------------------------------------------------------------------------------
#import scipy.stats as stats
import scipy.stats as stats
from scipy.stats import shapiro, kstest

# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames 


# Gestión de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

In [49]:
df_general = pd.read_csv("files/renewable_energy.csv")
df_general.head()

  LOCATION  INDICATOR SUBJECT MEASURE FREQUENCY  TIME     Value Flag Codes
0      AUS  RENEWABLE     TOT    KTOE         A  1960  4436.932        NaN
1      AUS  RENEWABLE     TOT    KTOE         A  1961  4490.510        NaN
2      AUS  RENEWABLE     TOT    KTOE         A  1962  4407.097        NaN
3      AUS  RENEWABLE     TOT    KTOE         A  1963  4628.738        NaN
4      AUS  RENEWABLE     TOT    KTOE         A  1964  4497.396        NaN

In [22]:
df_general.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15904 entries, 0 to 15903
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   LOCATION    15904 non-null  object
 1   INDICATOR   15904 non-null  object
 2   SUBJECT     15904 non-null  object
 3   MEASURE     15904 non-null  object
 4   FREQUENCY   15904 non-null  object
 5   TIME        15904 non-null  int64
 6   Value       12017 non-null  float64
 7   Flag Codes  3887 non-null   object
dtypes: float64(1), int64(1), object(6)
memory usage: 994.1+ KB

In [7]:
df_general.isna().sum()/df_general.shape[0]*100

LOCATION       0.000000
INDICATOR      0.000000
SUBJECT        0.000000
MEASURE        0.000000
FREQUENCY      0.000000
TIME           0.000000
Value         24.440392
Flag Codes    75.559608
dtype: float64

In [51]:
df_general[df_general["MEASURE"] == "KTOE"].isna().sum()/df_general.shape[0]*100

LOCATION       0.000000
INDICATOR      0.000000
SUBJECT        0.000000
MEASURE        0.000000
FREQUENCY      0.000000
TIME           0.000000
Value         12.185614
Flag Codes    37.814386
dtype: float64

In [52]:
df_general[df_general["MEASURE"] != "KTOE"].isna().sum()/df_general.shape[0]*100

LOCATION       0.000000
INDICATOR      0.000000
SUBJECT        0.000000
MEASURE        0.000000
FREQUENCY      0.000000
TIME           0.000000
Value         12.254779
Flag Codes    37.745221
dtype: float64

In [ ]:
df_general["Flag Codes"].isna().sum()/df_general.shape[0]*100 #esta columna puede quitarse

75.55960764587525

In [7]:
df_general[df_general["MEASURE"] != "KTOE"]

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
7952,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1960,14.09,NaN
7953,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1961,13.75,NaN
7954,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1962,12.93,NaN
7955,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1963,12.87,NaN
7956,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1964,12.02,NaN
...,...,...,...,...,...,...,...,...
15899,OECD,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,2011,8.15,NaN
15900,OECD,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,2012,8.71,NaN
15901,OECD,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,2013,9.16,NaN
15902,OECD,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,2014,9.38,NaN
15903,OECD,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,2015,9.64,NaN

In [53]:
df_general[(df_general["MEASURE"] != "KTOE") & (df_general["LOCATION"] == "AUS")].head()

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
7952,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1960,14.09,NaN
7953,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1961,13.75,NaN
7954,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1962,12.93,NaN
7955,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1963,12.87,NaN
7956,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1964,12.02,NaN

In [54]:
df_general.duplicated().sum()

np.int64(0)

**Columnas a eliminar** -> INDICATOR, MEASURE, Frecuency, Subject, Flag Codes. 

**General** -> Unificar nombres de columnas y Value que sea más descriptivo.

In [55]:
df_general.columns = df_general.columns.str.lower().str.replace(' ', '_').str.strip()

In [56]:
df_general.head()

  location  indicator subject measure frequency  time     value flag_codes
0      AUS  RENEWABLE     TOT    KTOE         A  1960  4436.932        NaN
1      AUS  RENEWABLE     TOT    KTOE         A  1961  4490.510        NaN
2      AUS  RENEWABLE     TOT    KTOE         A  1962  4407.097        NaN
3      AUS  RENEWABLE     TOT    KTOE         A  1963  4628.738        NaN
4      AUS  RENEWABLE     TOT    KTOE         A  1964  4497.396        NaN

In [57]:
df_general.columns

Index(['location', 'indicator', 'subject', 'measure', 'frequency', 'time',
       'value', 'flag_codes'],
      dtype='object')

In [34]:
for col in df_general.columns:
    print(col)
    print(df_general[col].unique())
    print('-'*50)

location
['AUS' 'AUT' 'BEL' 'CAN' 'CZE' 'DNK' 'FIN' 'FRA' 'DEU' 'GRC' 'HUN' 'ISL'
 'IRL' 'ITA' 'JPN' 'KOR' 'LUX' 'MEX' 'NLD' 'NZL' 'NOR' 'POL' 'PRT' 'SVK'
 'ESP' 'SWE' 'CHE' 'TUR' 'GBR' 'USA' 'OEU' 'ALB' 'DZA' 'ARG' 'ARM' 'AZE'
 'BGD' 'BLR' 'BIH' 'BRA' 'BRN' 'BGR' 'KHM' 'CHL' 'CHN' 'COL' 'HRV' 'CYP'
 'EGY' 'EST' 'ETH' 'GEO' 'GHA' 'HTI' 'HKG' 'IND' 'IDN' 'IRN' 'ISR' 'KAZ'
 'LVA' 'LTU' 'MKD' 'MYS' 'MLT' 'MDA' 'MOZ' 'NGA' 'PAK' 'PRY' 'PER' 'PHL'
 'ROU' 'RUS' 'SAU' 'SGP' 'SVN' 'ZAF' 'SDN' 'TWN' 'TZA' 'THA' 'UKR' 'ARE'
 'URY' 'VNM' 'ZMB' 'WLD' 'SRB' 'MNE' 'G20' 'EU28' 'OECD' 'AGO' 'BHR' 'BEN'
 'BOL' 'BWA' 'CMR' 'COG' 'CRI' 'CIV' 'CUB' 'PRK' 'COD' 'DOM' 'ECU' 'SLV'
 'ERI' 'GAB' 'GTM' 'HND' 'IRQ' 'JAM' 'JOR' 'KEN' 'KWT' 'KGZ' 'LBN' 'LBY'
 'MNG' 'MAR' 'MMR' 'NAM' 'NPL' 'NIC' 'NER' 'OMN' 'PAN' 'QAT' 'SEN' 'LKA'
 'SYR' 'TJK' 'TGO' 'TTO' 'TUN' 'TKM' 'UZB' 'VEN' 'YEM' 'ZWE']
--------------------------------------------------
indicator
['RENEWABLE']
--------------------------------------------------
subject
['TOT']
--------------------------------------------------
measure
['KTOE' 'PC_PRYENRGSUPPLY']
--------------------------------------------------
frequency
['A']
--------------------------------------------------
time
[1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973
 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987
 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001
 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015]
--------------------------------------------------
value
[4436.932 4490.51  4407.097 ...    7.78     8.15     8.71 ]
--------------------------------------------------
flag_codes
[nan 'L']
--------------------------------------------------

In [58]:
df_general = df_general[df_general["measure"] == "PC_PRYENRGSUPPLY"]

In [59]:
df_general.head(1)

,location,indicator,subject,measure,frequency,time,value,flag_codes
7952,AUS,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,1960,14.09,NaN

In [60]:
map = {'time': 'year', 'value': 'total_energy_supply'}

In [61]:
df_general = df_general.rename(columns = map)

In [62]:
df_general = df_general.drop(columns = ['indicator', 'subject', 'frequency', 'flag_codes', 'measure'])

In [63]:
df_general.sample(5)

      location  year  total_energy_supply
15471      ZMB  1975                76.59
10947      CRI  1987                44.27
11720      GAB  1976                44.85
12982      MKD  2006                10.84
12759      LVA  2007                29.34

In [64]:
df_general.to_csv('files/renewable_energy_clean.csv', index = False)

## Dataset: Renewable Energy World Wide : 1965~2022 
[Fuente](https://www.kaggle.com/datasets/belayethossainds/renewable-energy-world-wide-19652022/data?select=01+renewable-share-energy.csv)

`12-solar-energy-consumption.csv`:

In [70]:
df_solar_consump = pd.read_csv("files/12-solar-energy-consumption.csv")

df_solar_consump.head()

        Entity Code  Year  Electricity from solar (TWh)
0  Afghanistan  AFG  2000                           0.0
1  Afghanistan  AFG  2001                           0.0
2  Afghanistan  AFG  2002                           0.0
3  Afghanistan  AFG  2003                           0.0
4  Afghanistan  AFG  2004                           0.0

In [71]:
df_solar_consump.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8683 entries, 0 to 8682
Data columns (total 4 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Entity                        8683 non-null   object
 1   Code                          7227 non-null   object
 2   Year                          8683 non-null   int64
 3   Electricity from solar (TWh)  8683 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 271.5+ KB

In [72]:
df_solar_consump["Code"].isna().sum()/df_solar_consump.shape[0]*100

np.float64(16.768398019117818)

In [73]:
df_solar_consump.isna().sum()/df_solar_consump.shape[0]*100

Entity                           0.000000
Code                            16.768398
Year                             0.000000
Electricity from solar (TWh)     0.000000
dtype: float64

In [ ]:
df_solar_consump[df_solar_consump["Code"].notna()]

           Entity Code  Year  Electricity from solar (TWh)
0     Afghanistan  AFG  2000                          0.00
1     Afghanistan  AFG  2001                          0.00
2     Afghanistan  AFG  2002                          0.00
3     Afghanistan  AFG  2003                          0.00
4     Afghanistan  AFG  2004                          0.00
...           ...  ...   ...                           ...
8678     Zimbabwe  ZWE  2017                          0.01
8679     Zimbabwe  ZWE  2018                          0.02
8680     Zimbabwe  ZWE  2019                          0.03
8681     Zimbabwe  ZWE  2020                          0.03
8682     Zimbabwe  ZWE  2021                          0.04

[7227 rows x 4 columns]